In [1]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [23, 35, 45, 36, 28],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   23     New York
1      Bob   35  Los Angeles
2  Charlie   45      Chicago
3    David   36      Houston
4      Eva   28      Phoenix

In [2]:
df.iloc[2]

Name    Charlie
Age          45
City    Chicago
Name: 2, dtype: object

In [3]:
df.iloc[:, 1]

0    23
1    35
2    45
3    36
4    28
Name: Age, dtype: int64

In [4]:
df.iloc[0:3]

      Name  Age         City
0    Alice   23     New York
1      Bob   35  Los Angeles
2  Charlie   45      Chicago

In [5]:
df.iloc[0:3, [0, 2]]

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

In [6]:
df.loc[df['Name'] == 'Charlie']

      Name  Age     City
2  Charlie   45  Chicago

In [7]:
df.loc[:, 'Age']

0    23
1    35
2    45
3    36
4    28
Name: Age, dtype: int64

In [8]:
df.loc[df['Name'].isin(['Bob', 'Eva']), 'City']

1    Los Angeles
4        Phoenix
Name: City, dtype: object